Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.IsDataCompleted
Is the required data completed for this zone equipment?
Since:
2020

Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.AirSystemId
The air system used for this zone equipment, if applicable.
Since:
2020

Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.VRFLoopId
The Varible Refrigerant Flow loop for the VRF fan coil equipment type.
Since:
2020

Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.ChilledWaterLoopId
The chilled water loop used for the chilled water option of cooling coil.
Since:
2020

Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.CondenserWaterLoopId
The condenser water loop used for the direction expansion water cooled option of cooling coil.
Since:
2020

Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.HotWaterLoopId
The water loop element id for the hot-water heating coil.
Since:
2020

Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.CoolingCoilType
The type of cooling coil. Note this property change would reset the chilled water loop.
Since:
2020

Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.HeatingCoilType
The type of heating coil. Note this property change would reset the hot water loop.
Since:
2020

Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.EquipmentBehavior
The behavior of how zone equipment is allocated with assigned spaces.
Since:
2020

Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.EquipmentType
The type of zone equipment. Note this property would reset other properties.
Since:
2020

Autodesk.Revit.DB.Mechanical.ZoneEquipmentData
Represents the data and parameters of analytical zone equipment.
Since:
2020